	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 19.0.0.117 Build 20180804";
# mark_description "-S -g -o /home/s1736883/Work/PParMetrics/playground/assembly/experiment-1/experiment-1.g.s.icc";
	.file "experiment-1.cpp"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main
	.text
# mark_begin;

	.globl main
# --- main()
main:
..B1.1:                         # Preds ..B1.0
                                # Execution count [0.00e+00]
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value_main.2:
..L3:
                                                          #10.12
..LN0:
	.file   1 "/home/s1736883/Work/PParMetrics/playground/sources/experiment-1.cpp"
	.loc    1  10  is_stmt 1
        pushq     %rbp                                          #10.12
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #10.12
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        subq      $848, %rsp                                    #10.12
..LN3:
	.loc    1  15  prologue_end  is_stmt 1
        movl      $0, %eax                                      #15.16
..LN4:
        movq      %rax, %rdi                                    #15.16
..___tag_value_main.8:
..LN5:
#       time(time_t *)
        call      time                                          #15.16
..___tag_value_main.9:
..LN6:

	.loc    1  27  is_stmt 1
        movl      $0, %eax                                      #27.12
..LN81:
	.loc    1  27  epilogue_begin  is_stmt 1
        leave                                                   #27.12
	.cfi_restore 6
..LN82:
        ret                                                     #27.12
..LN83:
                                # LOE
..LN84:
	.cfi_endproc
# mark_end;
	.type	main,@function
	.size	main,.-main
..LNmain.85:
.LNmain:
	.data
	.file   2 "/usr/include/x86_64-linux-gnu/c++/7.2.0/bits/c++config.h"
# -- End  main
	.section .rodata, "a"
	.align 4
	.align 4
size:
	.long	100
	.type	size,@object
	.size	size,4
	.align 4
range:
	.long	10
	.type	range,@object
	.size	range,4
	.data
	.section .note.GNU-stack, ""
	.file   3 "/usr/include/stdlib.h"
	.file   4 "/usr/include/time.h"
	.file   5 "/usr/include/bits/types.h"
	.file   6 "/usr/include/bits/mathdef.h"
// -- Begin DWARF2 SEGMENT .debug_info
	.section .debug_info
.debug_info_seg:
	.align 1
	.4byte 0x0000037a
	.2byte 0x0004
	.4byte .debug_abbrev_seg
	.byte 0x08
//	DW_TAG_compile_unit:
	.byte 0x01
//	DW_AT_comp_dir:
	.4byte .debug_str
//	DW_AT_name:
	.4byte .debug_str+0x2b
//	DW_AT_producer:
	.4byte .debug_str+0x6f
	.4byte .debug_str+0xdb
//	DW_AT_language:
	.byte 0x04
//	DW_AT_use_UTF8:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LNmain.85-..L3
	.byte 0x01
//	DW_AT_stmt_list:
	.4byte .debug_line_seg
//	DW_TAG_namespace:
	.byte 0x02
//	DW_AT_name:
	.4byte 0x00647473
//	DW_TAG_namespace:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0xfd
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x13a
//	DW_TAG_imported_module:
	.byte 0x04
//	DW_AT_import:
	.4byte 0x00000038
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000155
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000181
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000001b4
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000001d1
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000001e3
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000001f7
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x0000022a
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000240
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000256
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000309
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000325
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000337
	.byte 0x00
//	DW_TAG_namespace:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x142
//	DW_TAG_namespace:
	.byte 0x07
//	DW_AT_decl_line:
	.2byte 0x0101
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x13a
//	DW_TAG_imported_module:
	.byte 0x04
//	DW_AT_import:
	.4byte 0x00000086
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000001f7
	.byte 0x00
//	DW_TAG_namespace:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x14c
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
//	DW_TAG_subprogram:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x0a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_AT_name:
	.4byte .debug_str+0x157
	.4byte .debug_str+0x157
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LNmain.85-..L3
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x0b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0061
//	DW_AT_type:
	.4byte 0x00000137
//	DW_AT_location:
	.4byte 0x79bc7603
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x0c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0062
//	DW_AT_type:
	.4byte 0x00000141
//	DW_AT_location:
	.4byte 0x7cd07603
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0063
//	DW_AT_type:
	.4byte 0x0000014b
//	DW_AT_location:
	.4byte 0x79b07603
//	DW_TAG_lexical_block:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN13
//	DW_AT_high_pc:
	.8byte ..LN54
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000130
//	DW_AT_location:
	.4byte 0x79b07603
	.byte 0x00
//	DW_TAG_lexical_block:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0x17
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN54
//	DW_AT_high_pc:
	.8byte ..LN80
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x17
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000130
//	DW_AT_location:
	.4byte 0x79b87603
	.byte 0x00
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x15c
//	DW_TAG_array_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00000130
//	DW_AT_byte_size:
	.2byte 0x0190
//	DW_TAG_subrange_type:
	.byte 0x0f
//	DW_AT_upper_bound:
	.byte 0x63
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00000130
//	DW_AT_byte_size:
	.2byte 0x0190
//	DW_TAG_subrange_type:
	.byte 0x0f
//	DW_AT_upper_bound:
	.byte 0x63
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00000130
//	DW_AT_byte_size:
	.2byte 0x0190
//	DW_TAG_subrange_type:
	.byte 0x0f
//	DW_AT_upper_bound:
	.byte 0x63
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x65
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x169
//	DW_AT_type:
	.4byte 0x00000160
//	DW_TAG_structure_type:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x62
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_byte_size:
	.byte 0x08
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x63
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x16f
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x64
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x0000009e
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x6d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x174
//	DW_AT_type:
	.4byte 0x0000018c
//	DW_TAG_structure_type:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x6a
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x6b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x16f
//	DW_AT_type:
	.4byte 0x000001ad
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x6c
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x000001ad
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x17b
//	DW_TAG_subprogram:
	.byte 0x14
//	DW_AT_decl_line:
	.2byte 0x0316
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000181
//	DW_AT_name:
	.4byte .debug_str+0x180
	.4byte .debug_str+0x180
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x15
//	DW_AT_type:
	.4byte 0x000001ad
//	DW_TAG_formal_parameter:
	.byte 0x15
//	DW_AT_type:
	.4byte 0x000001ad
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x16
//	DW_AT_decl_line:
	.2byte 0x0176
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_AT_name:
	.4byte .debug_str+0x185
	.4byte .debug_str+0x185
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_subprogram:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0178
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x18a
	.4byte .debug_str+0x18a
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x15
//	DW_AT_type:
	.4byte 0x00000130
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x79
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x190
//	DW_AT_type:
	.4byte 0x00000202
//	DW_TAG_structure_type:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x76
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x77
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x16f
//	DW_AT_type:
	.4byte 0x00000223
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x78
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x00000223
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x198
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x3b
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1a2
//	DW_AT_type:
	.4byte 0x00000235
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x87
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1aa
//	DW_AT_type:
	.4byte 0x000001ad
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x4b
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1b4
//	DW_AT_type:
	.4byte 0x0000024b
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x8b
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1bb
//	DW_AT_type:
	.4byte 0x000001ad
//	DW_TAG_structure_type:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x85
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_byte_size:
	.byte 0x38
//	DW_AT_name:
	.2byte 0x6d74
	.byte 0x00
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x87
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x1c4
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x88
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1cb
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x89
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x1d2
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x8a
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x0c
//	DW_AT_name:
	.4byte .debug_str+0x1da
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x8b
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x1e2
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x8c
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x14
//	DW_AT_name:
	.4byte .debug_str+0x1e9
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x8d
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x1f1
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x8e
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x1c
//	DW_AT_name:
	.4byte .debug_str+0x1f9
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x8f
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x201
//	DW_AT_type:
	.4byte 0x0000009e
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x92
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x20a
//	DW_AT_type:
	.4byte 0x000001ad
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x93
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x214
//	DW_AT_type:
	.4byte 0x000002f8
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x19
//	DW_AT_type:
	.4byte 0x000002fd
//	DW_TAG_const_type:
	.byte 0x1a
//	DW_AT_type:
	.4byte 0x00000302
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x21c
//	DW_TAG_subprogram:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xc0
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000240
//	DW_AT_name:
	.4byte .debug_str+0x221
	.4byte .debug_str+0x221
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x15
//	DW_AT_type:
	.4byte 0x00000320
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x19
//	DW_AT_type:
	.4byte 0x00000240
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x1d
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x226
//	DW_AT_type:
	.4byte 0x00000330
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x22f
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x1c
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x236
//	DW_AT_type:
	.4byte 0x00000342
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x23e
//	DW_TAG_variable:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x244
//	DW_AT_type:
	.4byte 0x0000035e
//	DW_AT_location:
	.2byte 0x0309
	.8byte size
//	DW_TAG_const_type:
	.byte 0x1a
//	DW_AT_type:
	.4byte 0x00000130
//	DW_TAG_variable:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x249
//	DW_AT_type:
	.4byte 0x0000035e
//	DW_AT_location:
	.2byte 0x0309
	.8byte range
//	DW_TAG_imported_module:
	.byte 0x04
//	DW_AT_import:
	.4byte 0x00000033
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x6a
	.byte 0x0c
	.byte 0x10
	.byte 0x17
	.2byte 0x0000
	.byte 0x02
	.byte 0x39
	.byte 0x01
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x03
	.byte 0x39
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x04
	.byte 0x3a
	.byte 0x00
	.byte 0x18
	.byte 0x13
	.2byte 0x0000
	.byte 0x05
	.byte 0x08
	.byte 0x00
	.byte 0x18
	.byte 0x13
	.2byte 0x0000
	.byte 0x06
	.byte 0x39
	.byte 0x01
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x07
	.byte 0x39
	.byte 0x00
	.byte 0x3b
	.byte 0x05
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x08
	.byte 0x39
	.byte 0x00
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x09
	.byte 0x24
	.byte 0x00
	.byte 0x0b
	.byte 0x0b
	.byte 0x3e
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x0a
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x6a
	.byte 0x0c
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x0b
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.byte 0x49
	.byte 0x13
	.byte 0x02
	.byte 0x18
	.2byte 0x0000
	.byte 0x0c
	.byte 0x0b
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.2byte 0x0000
	.byte 0x0d
	.byte 0x24
	.byte 0x00
	.byte 0x0b
	.byte 0x0b
	.byte 0x3e
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0e
	.byte 0x01
	.byte 0x01
