	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 19.0.0.117 Build 20180804";
# mark_description "-S -g -o /home/s1736883/Work/PParMetrics/playground/asm/debug/clang/debug.g.s.icc";
	.file "debug.cpp"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main
	.text
# mark_begin;

	.globl main
# --- main()
main:
..B1.1:                         # Preds ..B1.0
                                # Execution count [0.00e+00]
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value_main.2:
..L3:
                                                          #8.12
..LN0:
	.file   1 "/home/s1736883/Work/PParMetrics/playground/src/debug.cpp"
	.loc    1  8  is_stmt 1
        pushq     %rbp                                          #8.12
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #8.12
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        subq      $20016, %rsp                                  #8.12
..LN3:
	.loc    1  13  prologue_end  is_stmt 1
        movl      $0, -20016(%rbp)                              #13.11
..LN4:
	.loc    1  14  is_stmt 1
        movl      $1, -20012(%rbp)                              #14.11
..LN5:
	.loc    1  16  is_stmt 1
        movl      $0, -20008(%rbp)                              #16.16
..LN6:
                                # LOE rbx rbp rsp r12 r13 r14 r15 rip

	.file   2 "/usr/include/x86_64-linux-gnu/c++/7.4.0/bits/c++config.h"
	.file   3 "/usr/include/c++/7.4.0/bits/exception_ptr.h"
	.file   4 "/usr/include/c++/7.4.0/type_traits"
	.file   5 "/usr/include/c++/7.4.0/debug/debug.h"
	.file   6 "/usr/include/c++/7.4.0/bits/basic_string.h"
	.file   7 "/usr/include/c++/7.4.0/system_error"
	.file   8 "/usr/include/c++/7.4.0/bits/predefined_ops.h"
# -- End  main
	.text
.L_2__routine_start___sti__$E_1:
# -- Begin  __sti__$E
	.bss
	.align 4
	.align 1
_ZN17_INTERNAL15b24960St8__ioinitE:
	.type	_ZN17_INTERNAL15b24960St8__ioinitE,@object
	.size	_ZN17_INTERNAL15b24960St8__ioinitE,1
	.space 1	# pad
	.section .ctors, "wa"
	.align 8
__init_0:
	.type	__init_0,@object
	.size	__init_0,8
	.quad	__sti__$E
	.text
# mark_begin;

# --- __sti__$E()
__sti__$E:
..B2.1:                         # Preds ..B2.0
                                # Execution count [0.00e+00]
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value___sti__$E.13:
..L14:
                                                         #
..LN98:
        pushq     %rbp                                          #
	.cfi_def_cfa_offset 16
..LN99:
        movq      %rsp, %rbp                                    #
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN100:
        subq      $16, %rsp                                     #
..LN101:
	.file   9 "/usr/include/c++/7.4.0/iostream"
	.loc    9  74  prologue_end  is_stmt 1
        movl      $_ZN17_INTERNAL15b24960St8__ioinitE, %eax     #74.25
..LN102:
        movq      %rax, %rdi                                    #74.25
..___tag_value___sti__$E.19:
..LN103:
#       std::ios_base::Init::Init(std::ios_base::Init *)
        call      _ZNSt8ios_base4InitC1Ev                       #74.25
..___tag_value___sti__$E.20:
..LN104:
                                # LOE rbx rbp rsp r12 r13 r14 r15 rip
..B2.2:                         # Preds ..B2.1
                                # Execution count [0.00e+00]
..LN105:
        movl      $_ZNSt8ios_base4InitD1Ev, %eax                #74.25
..LN106:
        movl      $_ZN17_INTERNAL15b24960St8__ioinitE, %edx     #74.25
..LN107:
        movl      $__dso_handle, %ecx                           #74.25
..LN108:
        movq      %rax, %rdi                                    #74.25
..LN109:
        movq      %rdx, %rsi                                    #74.25
..LN110:
        movq      %rcx, %rdx                                    #74.25
..___tag_value___sti__$E.21:
..LN111:
        call      __cxa_atexit                                  #74.25
..___tag_value___sti__$E.22:
..LN112:
                                # LOE rbx rbp rsp r12 r13 r14 r15 rip eax
..B2.6:                         # Preds ..B2.2
                                # Execution count [0.00e+00]
..LN113:
        movl      %eax, -16(%rbp)                               #74.25
..LN114:
                                # LOE rbx rbp rsp r12 r13 r14 r15 rip
..B2.3:                         # Preds ..B2.6
                                # Execution count [0.00e+00]
..LN115:
	.loc    9  74  epilogue_begin  is_stmt 1
        leave                                                   #74.25
	.cfi_restore 6
..LN116:
        ret                                                     #74.25
..LN117:
                                # LOE
..LN118:
	.cfi_endproc
# mark_end;
	.type	__sti__$E,@function
	.size	__sti__$E,.-__sti__$E
..LN__sti__$E.119:
.LN__sti__$E:
	.data
# -- End  __sti__$E
	.section .rodata, "a"
	.align 4
	.align 1
_ZN17_INTERNAL15b24960St19piecewise_constructE:
	.byte	0
	.type	_ZN17_INTERNAL15b24960St19piecewise_constructE,@object
	.size	_ZN17_INTERNAL15b24960St19piecewise_constructE,1
	.data
	.hidden __dso_handle
# mark_proc_addr_taken __sti__$E;
	.section .note.GNU-stack, ""
	.file   10 "/usr/include/c++/7.4.0/bits/stl_pair.h"
	.file   11 "/usr/include/c++/7.4.0/bits/ios_base.h"
	.file   12 "/usr/include/x86_64-linux-gnu/c++/7.4.0/bits/atomic_word.h"
	.file   13 "/usr/include/stdlib.h"
	.file   14 "/usr/include/bits/types/clock_t.h"
	.file   15 "/usr/include/bits/types.h"
	.file   16 "/usr/include/bits/types/time_t.h"
	.file   17 "/usr/include/bits/types/struct_tm.h"
	.file   18 "/usr/include/math.h"
	.file   19 "/usr/include/bits/types/mbstate_t.h"
	.file   20 "/usr/include/bits/types/__mbstate_t.h"
	.file   21 "/usr/include/bits/types/wint_t.h"
	.file   22 "/opt/intel/compilers_and_libraries_2019.0.117/linux/compiler/include/stddef.h"
	.file   23 "/usr/include/wchar.h"
	.file   24 "/usr/include/bits/stdint-intn.h"
	.file   25 "/usr/include/stdint.h"
	.file   26 "/usr/include/bits/stdint-uintn.h"
	.file   27 "/usr/include/locale.h"
	.file   28 "/usr/include/bits/types/FILE.h"
	.file   29 "/usr/include/bits/libio.h"
	.file   30 "/usr/include/stdio.h"
	.file   31 "/usr/include/bits/_G_config.h"
	.file   32 "/usr/include/wctype.h"
	.file   33 "/usr/include/bits/wctype-wchar.h"
// -- Begin DWARF2 SEGMENT .debug_info
	.section .debug_info
.debug_info_seg:
	.align 1
	.4byte 0x00000de9
	.2byte 0x0004
	.4byte .debug_abbrev_seg
	.byte 0x08
//	DW_TAG_compile_unit:
	.byte 0x01
//	DW_AT_comp_dir:
	.4byte .debug_str
//	DW_AT_name:
	.4byte .debug_str+0x2b
//	DW_AT_producer:
	.4byte .debug_str+0x64
	.4byte .debug_str+0xd0
//	DW_AT_language:
	.byte 0x04
//	DW_AT_use_UTF8:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LN__sti__$E.119-..L3
	.byte 0x01
//	DW_AT_stmt_list:
	.4byte .debug_line_seg
//	DW_TAG_namespace:
	.byte 0x02
//	DW_AT_name:
	.4byte 0x00647473
//	DW_TAG_namespace:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0xfd
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x122
//	DW_TAG_namespace:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x34
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x12a
//	DW_TAG_class_type:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x4f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x12c
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x51
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x439
//	DW_AT_type:
	.4byte 0x000004ad
//	DW_TAG_subprogram:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x55
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x44d
//	DW_AT_name:
	.4byte .debug_str+0x47f
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x58
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x489
//	DW_AT_type:
	.4byte 0x000004ad
//	DW_AT_name:
	.4byte .debug_str+0x4b9
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e7
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x56
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x4c0
//	DW_AT_name:
	.4byte .debug_str+0x4f4
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
//	DW_TAG_class_type:
	.byte 0x0a
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x4ff
//	DW_TAG_subprogram:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x99
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x509
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000007f1
//	DW_AT_name:
	.4byte .debug_str+0x548
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e7
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x53
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x55d
//	DW_AT_name:
	.4byte .debug_str+0x12c
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000004ad
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x60
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x588
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x12c
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x62
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x5b2
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x12c
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000007fb
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x65
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x5e0
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x12c
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000116
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0xeb
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x60b
//	DW_AT_type:
	.4byte 0x00000800
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x69
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x627
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x12c
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000807
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x90
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x654
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000004ce
//	DW_AT_name:
	.4byte .debug_str+0x680
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e7
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x76
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x68e
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000080c
//	DW_AT_name:
	.4byte .debug_str+0x6bc
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000007fb
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x7a
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x6c6
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000080c
//	DW_AT_name:
	.4byte .debug_str+0x6bc
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000807
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x84
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x6f3
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x723
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x0000080c
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x81
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x728
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x752
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000007e2
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_namespace:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0a20
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x13a
//	DW_TAG_namespace:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0a6e
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x14e
//	DW_TAG_namespace:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x167
//	DW_TAG_namespace:
	.byte 0x12
//	DW_AT_decl_line:
	.2byte 0x1a0a
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x16f
//	DW_TAG_namespace:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x1a0c
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x178
	.byte 0x00
//	DW_TAG_namespace:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte 0x0032565f
//	DW_TAG_variable:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x4f
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1c3
//	DW_AT_type:
	.4byte 0x000004b9
//	DW_TAG_structure_type:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x4c
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1d7
//	DW_TAG_subprogram:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x4c
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x1ed
//	DW_AT_name:
	.4byte .debug_str+0x1d7
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000004be
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x4a
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x20e
//	DW_AT_type:
	.4byte 0x00000229
//	DW_TAG_class_type:
	.byte 0x16
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x217
//	DW_TAG_class_type:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0259
//	DW_AT_decl_file:
	.byte 0x0b
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x220
//	DW_TAG_variable:
	.byte 0x18
//	DW_AT_decl_line:
	.2byte 0x0261
//	DW_AT_decl_file:
	.byte 0x0b
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x225
	.4byte .debug_str+0x231
//	DW_AT_type:
	.4byte 0x000004c3
//	DW_TAG_variable:
	.byte 0x18
//	DW_AT_decl_line:
	.2byte 0x0262
//	DW_AT_decl_file:
	.byte 0x0b
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x260
	.4byte .debug_str+0x275
//	DW_AT_type:
	.4byte 0x000004ce
//	DW_TAG_subprogram:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x025d
//	DW_AT_decl_file:
	.byte 0x0b
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x2a5
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x220
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000004d5
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x025e
//	DW_AT_decl_file:
	.byte 0x0b
//	DW_AT_declaration:
	.byte 0x01
	.4byte .debug_str+0x2bd
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x2d5
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000004d5
//	DW_AT_artificial:
	.byte 0x01
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_imported_module:
	.byte 0x1a
//	DW_AT_import:
	.4byte 0x00000038
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000004da
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000506
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000539
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000556
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000589
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000059f
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000005b5
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000668
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000067c
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000687
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000006ef
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000070c
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000734
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000075b
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000077d
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000079f
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000007c1
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000046
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000811
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000827
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000844
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000861
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000087e
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000889
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000894
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000089f
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000008aa
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000008b5
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000008c7
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000008d2
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000008dd
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000008f3
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000008fe
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000091b
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000938
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000094e
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000964
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000096f
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000097a
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000985
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000990
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x0000099b
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000009a6
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000009bc
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x000009c7
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000b25
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000d67
//	DW_TAG_imported_module:
	.byte 0x1a
//	DW_AT_import:
	.4byte 0x000001d7
//	DW_TAG_imported_module:
	.byte 0x1a
//	DW_AT_import:
	.4byte 0x000001e8
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000d9e
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000db3
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0xe7
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x3ec
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0xe8
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0xc1e
//	DW_AT_type:
	.4byte 0x00000532
	.byte 0x00
//	DW_TAG_namespace:
	.byte 0x1c
//	DW_AT_name:
	.4byte .debug_str+0x188
//	DW_TAG_namespace:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0101
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x122
//	DW_TAG_namespace:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0x23
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x192
//	DW_TAG_imported_module:
	.byte 0x1a
//	DW_AT_import:
	.4byte 0x000003a5
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000556
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000389
//	DW_TAG_imported_declaration:
	.byte 0x1b
//	DW_AT_import:
	.4byte 0x00000394
	.byte 0x00
//	DW_TAG_namespace:
	.byte 0x1d
//	DW_AT_name:
	.4byte .debug_str+0x198
//	DW_TAG_namespace:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x38
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1a3
//	DW_TAG_imported_module:
	.byte 0x1a
//	DW_AT_import:
	.4byte 0x000001d0
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x1e
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
//	DW_TAG_subprogram:
	.byte 0x1f
//	DW_AT_decl_line:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000003db
//	DW_AT_name:
	.4byte .debug_str+0x1af
	.4byte .debug_str+0x1af
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LNmain.97-..L3
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0061
//	DW_AT_type:
	.4byte 0x0000046c
//	DW_AT_location:
	.4byte 0xe3e07604
	.byte 0x7e
//	DW_TAG_variable:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0x0a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0062
//	DW_AT_type:
	.4byte 0x0000047c
//	DW_AT_location:
	.4byte 0xe3d07604
	.byte 0x7e
//	DW_TAG_variable:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0x0c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x000003db
//	DW_AT_location:
	.4byte 0xe3dc7604
	.byte 0x7e
//	DW_TAG_variable:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006b
//	DW_AT_type:
	.4byte 0x000003db
//	DW_AT_location:
	.4byte 0xe3d07604
	.byte 0x7e
//	DW_TAG_variable:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x000003db
//	DW_AT_location:
	.4byte 0xe3d47604
	.byte 0x7e
//	DW_TAG_lexical_block:
	.byte 0x21
//	DW_AT_decl_line:
	.byte 0x10
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN5
//	DW_AT_high_pc:
	.8byte ..LN92
//	DW_TAG_variable:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0x10
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006d
//	DW_AT_type:
	.4byte 0x000003db
//	DW_AT_location:
	.4byte 0xe3d87604
	.byte 0x7e
	.byte 0x00
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x22
//	DW_AT_type:
	.4byte 0x000003db
//	DW_AT_byte_size:
	.2byte 0x4e20
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x09
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x09
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x09
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x04
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x24
//	DW_AT_type:
	.4byte 0x000003db
//	DW_AT_byte_size:
	.byte 0x50
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x03
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x04
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x25
//	DW_AT_artificial:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1b4
	.4byte .debug_str+0x1b4
//	DW_AT_low_pc:
	.8byte ..L14
//	DW_AT_high_pc:
	.8byte ..LN__sti__$E.119-..L14
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x000004a6
//	DW_TAG_subroutine_type:
	.byte 0x27
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000004ad
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x000004b2
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1be
//	DW_TAG_const_type:
	.byte 0x29
//	DW_AT_type:
	.4byte 0x000001fb
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x000001fb
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_name:
	.4byte .debug_str+0x253
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x2a0
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x00000229
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x3e
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_name:
	.4byte .debug_str+0x2db
//	DW_AT_type:
	.4byte 0x000004e5
//	DW_TAG_structure_type:
	.byte 0x2a
//	DW_AT_decl_line:
	.byte 0x3b
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x08
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x3c
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x2e1
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x2b
//	DW_AT_decl_line:
	.byte 0x3d
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x000003db
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_name:
	.4byte .debug_str+0x2e6
//	DW_AT_type:
	.4byte 0x00000511
//	DW_TAG_structure_type:
	.byte 0x2a
//	DW_AT_decl_line:
	.byte 0x43
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x2e1
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_member:
	.byte 0x2b
//	DW_AT_decl_line:
	.byte 0x45
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x00000532
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x2ed
//	DW_TAG_subprogram:
	.byte 0x2c
//	DW_AT_decl_line:
	.2byte 0x0353
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000506
//	DW_AT_name:
	.4byte .debug_str+0x2f2
	.4byte .debug_str+0x2f2
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000532
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x50
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_name:
	.4byte .debug_str+0x2f7
//	DW_AT_type:
	.4byte 0x00000561
//	DW_TAG_structure_type:
	.byte 0x2a
//	DW_AT_decl_line:
	.byte 0x4d
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x4e
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x2e1
//	DW_AT_type:
	.4byte 0x00000582
//	DW_TAG_member:
	.byte 0x2b
//	DW_AT_decl_line:
	.byte 0x4f
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x00000582
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x2ff
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x0e
//	DW_AT_name:
	.4byte .debug_str+0x309
//	DW_AT_type:
	.4byte 0x00000594
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x90
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x311
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x31b
//	DW_AT_type:
	.4byte 0x000005aa
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x94
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x322
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_structure_type:
	.byte 0x2d
//	DW_AT_decl_line:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_byte_size:
	.byte 0x38
//	DW_AT_name:
	.2byte 0x6d74
	.byte 0x00
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x32b
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x0a
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x332
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x0b
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x339
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x0c
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x0c
//	DW_AT_name:
	.4byte .debug_str+0x341
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x349
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x14
//	DW_AT_name:
	.4byte .debug_str+0x350
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x358
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x10
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x1c
//	DW_AT_name:
	.4byte .debug_str+0x360
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x368
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x371
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x15
//	DW_AT_decl_file:
	.byte 0x11
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x37b
//	DW_AT_type:
	.4byte 0x00000657
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x0000065c
//	DW_TAG_const_type:
	.byte 0x29
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x383
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x9c
//	DW_AT_decl_file:
	.byte 0x12
//	DW_AT_name:
	.4byte .debug_str+0x388
//	DW_AT_type:
	.4byte 0x00000673
//	DW_TAG_base_type:
	.byte 0x2e
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_bit_size:
	.byte 0x50
//	DW_AT_bit_offset:
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x391
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x9b
//	DW_AT_decl_file:
	.byte 0x12
//	DW_AT_name:
	.4byte .debug_str+0x39d
//	DW_AT_type:
	.4byte 0x00000673
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x13
//	DW_AT_name:
	.4byte .debug_str+0x3a5
//	DW_AT_type:
	.4byte 0x00000692
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x15
//	DW_AT_decl_file:
	.byte 0x14
//	DW_AT_name:
	.4byte .debug_str+0x3af
//	DW_AT_type:
	.4byte 0x0000069d
//	DW_TAG_structure_type:
	.byte 0x2a
//	DW_AT_decl_line:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x14
//	DW_AT_byte_size:
	.byte 0x08
//	DW_TAG_union_type:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x14
//	DW_AT_byte_size:
	.byte 0x04
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x14
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x3bb
//	DW_AT_type:
	.4byte 0x000006df
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x14
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x3ce
//	DW_AT_type:
	.4byte 0x000006e6
	.byte 0x00
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x14
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x3d5
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x14
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x3dd
//	DW_AT_type:
	.4byte 0x000006a1
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x3c1
//	DW_TAG_array_type:
	.byte 0x24
//	DW_AT_type:
	.4byte 0x00000661
//	DW_AT_byte_size:
	.byte 0x04
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x15
//	DW_AT_name:
	.4byte .debug_str+0x3e5
//	DW_AT_type:
	.4byte 0x000006df
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x16
//	DW_AT_name:
	.4byte .debug_str+0x3ec
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x3f3
//	DW_TAG_subprogram:
	.byte 0x30
//	DW_AT_decl_line:
	.byte 0xde
//	DW_AT_decl_file:
	.byte 0x17
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000006fa
//	DW_AT_name:
	.4byte .debug_str+0x401
	.4byte .debug_str+0x401
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000723
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x00000728
//	DW_TAG_const_type:
	.byte 0x29
//	DW_AT_type:
	.4byte 0x0000072d
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x408
//	DW_TAG_subprogram:
	.byte 0x2c
//	DW_AT_decl_line:
	.2byte 0x0102
//	DW_AT_decl_file:
	.byte 0x17
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000003db
//	DW_AT_name:
	.4byte .debug_str+0x410
	.4byte .debug_str+0x410
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000723
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000723
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000006fa
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x0000072d
//	DW_TAG_subprogram:
	.byte 0x2c
//	DW_AT_decl_line:
	.2byte 0x0106
//	DW_AT_decl_file:
	.byte 0x17
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000756
//	DW_AT_name:
	.4byte .debug_str+0x418
	.4byte .debug_str+0x418
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000756
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000723
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000006fa
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x2c
//	DW_AT_decl_line:
	.2byte 0x010b
//	DW_AT_decl_file:
	.byte 0x17
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000756
//	DW_AT_name:
	.4byte .debug_str+0x420
	.4byte .debug_str+0x420
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000756
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000723
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000006fa
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x2c
//	DW_AT_decl_line:
	.2byte 0x010f
//	DW_AT_decl_file:
	.byte 0x17
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000756
//	DW_AT_name:
	.4byte .debug_str+0x429
	.4byte .debug_str+0x429
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000756
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x0000072d
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000006fa
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x30
//	DW_AT_decl_line:
	.byte 0xf9
//	DW_AT_decl_file:
	.byte 0x17
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000723
//	DW_AT_name:
	.4byte .debug_str+0x431
	.4byte .debug_str+0x431
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x00000723
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x0000072d
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000006fa
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x00000046
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x000007ec
//	DW_TAG_const_type:
	.byte 0x29
//	DW_AT_type:
	.4byte 0x00000046
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x000007f6
//	DW_TAG_const_type:
	.byte 0x29
//	DW_AT_type:
	.4byte 0x00000099
//	DW_TAG_reference_type:
	.byte 0x31
//	DW_AT_type:
	.4byte 0x000007ec
//	DW_TAG_unspecified_type:
	.byte 0x32
//	DW_AT_decl_line:
	.byte 0xeb
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x615
	.byte 0x33
//	DW_AT_type:
	.4byte 0x00000046
//	DW_TAG_reference_type:
	.byte 0x31
//	DW_AT_type:
	.4byte 0x00000046
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x18
//	DW_AT_decl_file:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x761
//	DW_AT_type:
	.4byte 0x0000081c
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x24
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x768
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x771
//	DW_AT_type:
	.4byte 0x00000832
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x26
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x779
//	DW_AT_type:
	.4byte 0x0000083d
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x783
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x1a
//	DW_AT_decl_file:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x790
//	DW_AT_type:
	.4byte 0x0000084f
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x28
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x798
//	DW_AT_type:
	.4byte 0x0000085a
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x3c3
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x7a2
//	DW_AT_type:
	.4byte 0x0000086c
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x2b
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x7aa
//	DW_AT_type:
	.4byte 0x00000877
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x3f5
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x7b4
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x7c0
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x7cd
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x7da
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x2b
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x7e7
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x7f4
//	DW_AT_type:
	.4byte 0x000008c0
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x78a
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x2d
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x802
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x810
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x6f
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x81e
//	DW_AT_type:
	.4byte 0x000008e8
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x3d
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x827
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x61
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x832
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x18
//	DW_AT_decl_file:
	.byte 0x1a
//	DW_AT_name:
	.4byte .debug_str+0x83b
//	DW_AT_type:
	.4byte 0x00000909
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x25
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x843
//	DW_AT_type:
	.4byte 0x00000914
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x84d
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x1a
//	DW_AT_name:
	.4byte .debug_str+0x85b
//	DW_AT_type:
	.4byte 0x00000926
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x864
//	DW_AT_type:
	.4byte 0x00000931
//	DW_TAG_base_type:
	.byte 0x28
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x86f
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x1a
//	DW_AT_decl_file:
	.byte 0x1a
//	DW_AT_name:
	.4byte .debug_str+0x87e
//	DW_AT_type:
	.4byte 0x00000943
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x887
//	DW_AT_type:
	.4byte 0x000006df
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x1a
//	DW_AT_name:
	.4byte .debug_str+0x892
//	DW_AT_type:
	.4byte 0x00000959
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x89b
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x51
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x8a6
//	DW_AT_type:
	.4byte 0x00000914
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x53
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x8b3
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x54
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x8c1
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x55
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x8cf
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x8dd
//	DW_AT_type:
	.4byte 0x00000914
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x3a
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x8eb
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x70
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x8fa
//	DW_AT_type:
	.4byte 0x000009b1
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x3e
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x904
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x64
//	DW_AT_decl_file:
	.byte 0x19
//	DW_AT_name:
	.4byte .debug_str+0x910
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_structure_type:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x33
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_byte_size:
	.byte 0x60
//	DW_AT_name:
	.4byte .debug_str+0x91a
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x37
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x920
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x38
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x92e
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x3e
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x93c
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x945
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x45
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x955
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x965
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x977
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x38
//	DW_AT_name:
	.4byte .debug_str+0x989
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x49
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x996
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x4a
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x48
//	DW_AT_name:
	.4byte .debug_str+0x9a4
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x4b
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x50
//	DW_AT_name:
	.4byte .debug_str+0x9b2
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x4c
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x51
//	DW_AT_name:
	.4byte .debug_str+0x9b6
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x4e
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x52
//	DW_AT_name:
	.4byte .debug_str+0x9c2
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x50
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x53
//	DW_AT_name:
	.4byte .debug_str+0x9d0
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x52
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x54
//	DW_AT_name:
	.4byte .debug_str+0x9df
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x54
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x55
//	DW_AT_name:
	.4byte .debug_str+0x9ed
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x5b
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x56
//	DW_AT_name:
	.4byte .debug_str+0x9fc
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x5c
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x57
//	DW_AT_name:
	.4byte .debug_str+0xa08
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x5f
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x58
//	DW_AT_name:
	.4byte .debug_str+0xa14
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x61
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x59
//	DW_AT_name:
	.4byte .debug_str+0xa26
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x63
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5a
//	DW_AT_name:
	.4byte .debug_str+0xa39
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x65
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5b
//	DW_AT_name:
	.4byte .debug_str+0xa4b
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x6c
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5c
//	DW_AT_name:
	.4byte .debug_str+0xa5e
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x6d
//	DW_AT_decl_file:
	.byte 0x1b
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5d
//	DW_AT_name:
	.4byte .debug_str+0xa6e
//	DW_AT_type:
	.4byte 0x00000661
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x1c
//	DW_AT_name:
	.4byte .debug_str+0xa7e
//	DW_AT_type:
	.4byte 0x00000b30
//	DW_TAG_structure_type:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0xf5
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_byte_size:
	.byte 0xd8
//	DW_AT_name:
	.4byte .debug_str+0xa83
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xf6
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0xa8c
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xfb
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0xa93
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xfc
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0xaa0
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xfd
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0xaad
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xfe
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0xabb
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xff
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0xaca
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0100
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0xad8
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0101
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x38
//	DW_AT_name:
	.4byte .debug_str+0xae6
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0102
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0xaf3
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0104
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x48
//	DW_AT_name:
	.4byte .debug_str+0xaff
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0105
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x50
//	DW_AT_name:
	.4byte .debug_str+0xb0d
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0106
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x58
//	DW_AT_name:
	.4byte .debug_str+0xb1d
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0108
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x60
//	DW_AT_name:
	.4byte .debug_str+0xb2a
//	DW_AT_type:
	.4byte 0x00000cf2
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x010a
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x68
//	DW_AT_name:
	.4byte .debug_str+0xb4f
//	DW_AT_type:
	.4byte 0x00000d2a
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x010c
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x70
//	DW_AT_name:
	.4byte .debug_str+0xb56
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0110
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x74
//	DW_AT_name:
	.4byte .debug_str+0xb5e
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0112
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x78
//	DW_AT_name:
	.4byte .debug_str+0xb66
//	DW_AT_type:
	.4byte 0x00000d2f
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0116
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01802303
//	DW_AT_name:
	.4byte .debug_str+0xb7a
//	DW_AT_type:
	.4byte 0x00000931
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0117
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01822303
//	DW_AT_name:
	.4byte .debug_str+0xb86
//	DW_AT_type:
	.4byte 0x00000661
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0118
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01832303
//	DW_AT_name:
	.4byte .debug_str+0xb95
//	DW_AT_type:
	.4byte 0x00000d3a
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x011c
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01882303
//	DW_AT_name:
	.4byte .debug_str+0xb9f
//	DW_AT_type:
	.4byte 0x00000d43
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0125
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01902303
//	DW_AT_name:
	.4byte .debug_str+0xb6a
//	DW_AT_type:
	.4byte 0x00000d53
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x012d
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01982303
//	DW_AT_name:
	.4byte .debug_str+0xbba
//	DW_AT_type:
	.4byte 0x000004ad
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x012e
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01a02303
//	DW_AT_name:
	.4byte .debug_str+0xbc1
//	DW_AT_type:
	.4byte 0x000004ad
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x012f
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01a82303
//	DW_AT_name:
	.4byte .debug_str+0xbc8
//	DW_AT_type:
	.4byte 0x000004ad
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0130
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01b02303
//	DW_AT_name:
	.4byte .debug_str+0xbcf
//	DW_AT_type:
	.4byte 0x000004ad
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0132
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01b82303
//	DW_AT_name:
	.4byte .debug_str+0xbd6
//	DW_AT_type:
	.4byte 0x000006fa
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0133
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01c02303
//	DW_AT_name:
	.4byte .debug_str+0xbdd
//	DW_AT_type:
	.4byte 0x000003db
//	DW_TAG_member:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0135
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.4byte 0x01c42303
//	DW_AT_name:
	.4byte .debug_str+0xbe3
//	DW_AT_type:
	.4byte 0x00000d5e
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x00000cf7
//	DW_TAG_structure_type:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0xa0
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_byte_size:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0xb33
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xa1
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0xb3e
//	DW_AT_type:
	.4byte 0x00000cf2
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xa2
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0xb44
//	DW_AT_type:
	.4byte 0x00000d2a
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xa6
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0xb4a
//	DW_AT_type:
	.4byte 0x000003db
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x00000b30
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x8c
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0xb72
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_array_type:
	.byte 0x24
//	DW_AT_type:
	.4byte 0x00000661
//	DW_AT_byte_size:
	.byte 0x01
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x00000d48
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x9a
//	DW_AT_decl_file:
	.byte 0x1d
//	DW_AT_name:
	.4byte .debug_str+0xba5
//	DW_AT_type:
	.4byte 0x000004b2
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x8d
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0xbb0
//	DW_AT_type:
	.4byte 0x00000532
//	DW_TAG_array_type:
	.byte 0x24
//	DW_AT_type:
	.4byte 0x00000661
//	DW_AT_byte_size:
	.byte 0x14
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.byte 0x13
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x4e
//	DW_AT_decl_file:
	.byte 0x1e
//	DW_AT_name:
	.4byte .debug_str+0xbec
//	DW_AT_type:
	.4byte 0x00000d72
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x1e
//	DW_AT_decl_file:
	.byte 0x1f
//	DW_AT_name:
	.4byte .debug_str+0xbf3
//	DW_AT_type:
	.4byte 0x00000d7d
//	DW_TAG_structure_type:
	.byte 0x2a
//	DW_AT_decl_line:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x1f
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x1c
//	DW_AT_decl_file:
	.byte 0x1f
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0xbfd
//	DW_AT_type:
	.4byte 0x00000d2f
//	DW_TAG_member:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x1d
//	DW_AT_decl_file:
	.byte 0x1f
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0xc03
//	DW_AT_type:
	.4byte 0x00000692
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_file:
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0xc0b
//	DW_AT_type:
	.4byte 0x00000da9
//	DW_TAG_pointer_type:
	.byte 0x26
//	DW_AT_type:
	.4byte 0x00000dae
//	DW_TAG_const_type:
	.byte 0x29
//	DW_AT_type:
	.4byte 0x0000084f
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x26
//	DW_AT_decl_file:
	.byte 0x21
//	DW_AT_name:
	.4byte .debug_str+0xc15
//	DW_AT_type:
	.4byte 0x00000705
//	DW_TAG_variable:
	.byte 0x35
//	DW_AT_specification:
	.4byte 0x000001ef
//	DW_AT_location:
	.2byte 0x0309
	.8byte _ZN17_INTERNAL15b24960St19piecewise_constructE
//	DW_TAG_variable:
	.byte 0x35
//	DW_AT_specification:
	.4byte 0x00000217
//	DW_AT_location:
	.2byte 0x0309
	.8byte _ZN17_INTERNAL15b24960St8__ioinitE
//	DW_TAG_variable:
	.byte 0x36
//	DW_AT_name:
	.4byte .debug_str+0xc28
//	DW_AT_type:
	.4byte 0x000004ad
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_imported_module:
	.byte 0x1a
//	DW_AT_import:
	.4byte 0x00000033
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x6a
	.byte 0x0c
	.byte 0x10
	.byte 0x17
	.2byte 0x0000
	.byte 0x02
	.byte 0x39
	.byte 0x01
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x03
	.byte 0x39
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x04
	.byte 0x39
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x05
	.byte 0x02
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x0b
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x06
	.byte 0x0d
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x38
	.byte 0x18
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x07
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.2byte 0x4087
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x08
	.byte 0x05
	.byte 0x00
	.byte 0x49
	.byte 0x13
	.byte 0x34
	.byte 0x0c
	.2byte 0x0000
	.byte 0x09
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.2byte 0x4087
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0a
	.byte 0x02
	.byte 0x00
	.byte 0x3c
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0b
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.2byte 0x4087
	.byte 0x0e
	.byte 0x32
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0c
	.byte 0x05
	.byte 0x00
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x0d
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.2byte 0x4087
	.byte 0x0e
	.byte 0x32
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0e
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.2byte 0x4087
	.byte 0x0e
	.byte 0x32
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x0f
	.byte 0x16
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x10
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.2byte 0x4087
	.byte 0x0e
	.byte 0x32
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x11
